docs/sample-output/01_DoExport_B2BGateway.request.xml

<?xml version="1.0"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Body>
		<ns2:request xmlns:ns2="http://www.datapower.com/schemas/management"
			domain="XB60-B2B-Tutorial">
			<ns2:do-export format="ZIP" all-files="false"
				persisted="true">
				<ns2:object class="B2BGateway" name="" ref-objects="true"
					ref-files="true" include-debug="false" />
			</ns2:do-export>
		</ns2:request>
	</S:Body>
</S:Envelope>
